Catalogs/Палаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Палаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гендер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПалаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПалат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДвижениеКоечногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеКоечногоФонда</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКоек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Койка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/БронированиеКойкоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>БронированиеКойкоМеста</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаУсловийПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаУсловийПребывания</Name>
			<Comment>Установка условий пребывания в стационаре</Comment>
			<BasedOn>
				<xr:Item>Document.ОбращениеВСтационар</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияПребывания</xr:Item>
				<xr:Item>InformationRegister.омг_ТекущиеМедицинскиеКарты</xr:Item>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
				<xr:Item>InformationRegister.КлиентыСтационара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияВСтационаре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбращения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеВСтационар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Палаты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Перем РаскрытиеСтрокПриВыбореФилиала;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	Филиал = УчетнаяПолитика.Филиал;
	Элементы.Филиал.Видимость = ПараметрыСеанса.УчетПоНесколькимФилиалам;
	УстановитьОтборПоФилиалу(Список, Филиал);
		
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Палата", Элементы.Список.ТекущаяСтрока);
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	КойкиССостоянием.Параметры.УстановитьЗначениеПараметра("Палата", Элементы.Список.ТекущаяСтрока);
	КойкиНаХранении.Параметры.УстановитьЗначениеПараметра("Подразделение", Неопределено);
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаскрытиеСтрокПриВыбореФилиала = Ложь;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданиеКоек" Тогда
		ОбновитьСпискиКоек();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКойку(Команда)
	
	СтруктураПараметров = Новый Структура("Палата", Элементы.Список.ТекущаяСтрока);
	
	ОткрытьФорму("Справочник.КойкоМеста.ФормаОбъекта", СтруктураПараметров,,,,, Новый ОписаниеОповещения("Оповещение_ОбновитьКойки", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиВПалатеПереместить(Команда)
	
	ПереместитьКойки("КойкиВПалате");
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиССостояниемПереместить(Команда)
	
	ПереместитьКойки("КойкиССостоянием", Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиНаХраненииПереместить(Команда)
	
	ПереместитьКойки("КойкиНаХранении",,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюПоПалате(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда 
				
		ОткрытьФорму("РегистрСведений.ДвижениеКоечногоФонда.ФормаСписка", Новый Структура("Палата", Элементы.Список.ТекущаяСтрока), ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКойку(Команда)
	
	ТекущиеДанные = Элементы.КойкиВПалате.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьЗначение(ТекущиеДанные.Койка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено
		И Не РаскрытиеСтрокПриВыбореФилиала 
	Тогда
		ОбновитьСпискиКоек();
		
		СтрокаПалата = ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты");
		Элементы.ФормаСоздатьКойку.Доступность = СтрокаПалата;
		Элементы.СписокОткрытьИсториюПоПалате.Доступность = СтрокаПалата;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура КойкиВПалатеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КойкиВПалатеКойка" Тогда
		ОткрытьИсториюКоечногоФонда("Койка", Элементы.КойкиВПалате.ТекущиеДанные.Койка);
	Иначе
		ОткрытьДокументРегистратор(Элементы.КойкиВПалате.ТекущиеДанные.Регистратор);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиССостояниемВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьИсториюКоечногоФонда("Койка", Элементы.КойкиССостоянием.ТекущиеДанные.Койка);	
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиНаХраненииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьИсториюКоечногоФонда("Койка", Элементы.КойкиНаХранении.ТекущиеДанные.Койка);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиССостояниемПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтруктураПараметров = Новый Структура("Койки", ПараметрыПеретаскивания.Значение);
		СтруктураПараметров.Вставить("УстановкаСостояния", Истина);
		
		ОткрытьФорму("Справочник.КойкоМеста.Форма.ФормаПеремещенияКоек", СтруктураПараметров, ЭтотОбъект,,,,Новый ОписаниеОповещения("Оповещение_ОбновитьКойки",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиВПалатеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыполнитьДвижениеКоечногоФонда(ПараметрыПеретаскивания.Значение, Элементы.Список.ТекущаяСтрока); 
		ОбновитьСпискиКоек();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиНаХраненииПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыполнитьДвижениеКоечногоФонда(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Справочник.Палаты.Хранение")); 
		ОбновитьСпискиКоек();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура("Койки", ПараметрыПеретаскивания.Значение);
	СтруктураПараметров.Вставить("ПеремещениеКоек", Истина);
	СтруктураПараметров.Вставить("Палата", Строка);
		
	ОткрытьФорму("Справочник.КойкоМеста.Форма.ФормаПеремещенияКоек", СтруктураПараметров, ЭтотОбъект,,,,Новый ОписаниеОповещения("Оповещение_ОбновитьКойки",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Строка) <> Тип("СправочникСсылка.Палаты") Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент) 
	
	Если Не Филиал.Пустая() Тогда
		УстановитьОтборПоФилиалу(Список, Филиал);
	Иначе
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;
	ОбновитьСпискиКоек();
	РаскрытьСписок();

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбновитьСпискиКоек()
	
	Палата = ?(ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты"),Элементы.Список.ТекущаяСтрока, Неопределено);
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Подразделение = ?(ТекущиеДанные.РодительскаяГруппировкаСтроки <> Неопределено, ТекущиеДанные.РодительскаяГруппировкаСтроки.Ключ, ТекущиеДанные.Подразделение);
	КонецЕсли;	
		
	ОбновитьСпискиКоекНаСервере(Палата, Подразделение);
	
КонецПроцедуры                                                        

&НаСервере
Процедура ОбновитьСпискиКоекНаСервере(Палата, Подразделение)
	
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Палата", Палата);
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	КойкиССостоянием.Параметры.УстановитьЗначениеПараметра("Палата", Палата);
	КойкиНаХранении.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	Элементы.Список.Обновить();
	
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОбновитьКойки(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСпискиКоек();	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоФилиалу(ДинамическийСписок, Филиал)
	
	ДинамическийСписок.Отбор.Элементы.Очистить();
	ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение.Филиал");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Филиал; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоечногоФонда(Ключ, Значение)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить(Ключ, Значение);
	
	ОткрытьФорму("РегистрСведений.ДвижениеКоечногоФонда.ФормаСписка", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьДвижениеКоечногоФонда(Койки, Палата = Неопределено, Состояние = Неопределено)
	
	ОшибочныеКойки = РегистрыСведений.ДвижениеКоечногоФонда.ВыполнитьДвижениеКоечногоФонда(Койки,Палата,Состояние);
	
	Если ОшибочныеКойки.Количество() > 0 Тогда
		Отказ = Истина;
		ТекстОшибки = "Перемещено " + Строка(Койки.Количество() - ОшибочныеКойки.Количество()) + " коек.
			|Следующие койки заняты и не могут быть перемещены:";
		
		Для Каждого Койка Из ОшибочныеКойки Цикл
			ТекстОшибки = ТекстОшибки + Символы.ПС + Койка;		
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ТекстОшибки);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьКойки(ИмяСписка, ПалатаПоУмолчанию = Неопределено, ПеремещениеКоек = Ложь)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Койки", Элементы[ИмяСписка].ВыделенныеСтроки);
		Если ПалатаПоУмолчанию <> Неопределено Тогда
			СтруктураПараметров.Вставить("Палата", ПалатаПоУмолчанию);
		КонецЕсли;
		Если ПеремещениеКоек Тогда
			СтруктураПараметров.Вставить("ПеремещениеКоек", ПеремещениеКоек);	
		КонецЕсли;
		
		ОткрытьФорму("Справочник.КойкоМеста.Форма.ФормаПеремещенияКоек", СтруктураПараметров, ЭтотОбъект,,,,Новый ОписаниеОповещения("Оповещение_ОбновитьКойки",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьСписок() Экспорт

	Палаты = ПолучитьПалатыФилиала(Филиал);
	
	РаскрытиеСтрокПриВыбореФилиала = Истина;
	Для Каждого Палата Из Палаты Цикл
		Элементы.Список.ТекущаяСтрока = Палата;	
	КонецЦикла;
	РаскрытиеСтрокПриВыбореФилиала = Ложь;
	ОбновитьСпискиКоек();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПалатыФилиала(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Палаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Палаты КАК Палаты
	               |ГДЕ
	               |	Палаты.Подразделение.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивПалат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПалат.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивПалат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДокументРегистратор(Документ)

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
		ОткрытьФорму("Документ.БронированиеКойкоМеста.Форма.ФормаДокумента",Новый Структура("Ключ", Документ), ЭтотОбъект);		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.УстановкаУсловийПребывания") Тогда
		ОткрытьФорму("Документ.УстановкаУсловийПребывания.Форма.ФормаДокумента",Новый Структура("Ключ", Документ), ЭтотОбъект);			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
